smp-client/docs/A05_CVB_Step1_SOAP.xml

<!--
A05_CVB_Step1_SOAP.xml

This request will come from TRIPLE

Following services will be added:
1. email_server_unblock as a child service of cable_broadband service.
	
-->
<!-- $Id: A05_CVB_Step1_SOAP.xml,v 1.1 2009/11/23 13:29:21 varshag Exp $ -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<m:executeXml xmlns:m="http://www.sigma-systems.com/schemas/3.1/SmpXmlOrderAPI" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <xmlRequest xsi:type="xsd:string">&lt;smpsa:executeOrderRequest xmlns:smpsa=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:cmn=&quot;http://java.sun.com/products/oss/xml/Common&quot; xmlns:sa=&quot;http://java.sun.com/products/oss/xml/ServiceActivation&quot; xmlns:smpcbe=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xmlns:smpcmn=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCommonValues&quot; xmlns:cbesvc=&quot;http://java.sun.com/products/oss/xml/CBE/Service&quot;&gt;
  &lt;smp:orderValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xsi:type=&quot;smp:ActionOrderValue&quot;&gt;
    &lt;cmn:lastUpdateVersionNumber&gt;-1&lt;/cmn:lastUpdateVersionNumber&gt;
    &lt;sa:apiClientId&gt;web&lt;/sa:apiClientId&gt;
    &lt;sa:orderKey xsi:type=&quot;smp:OrderKeyType&quot;&gt;
      &lt;cmn:type&gt;com.sigma.samp.cmn.order.SampOrderKey&lt;/cmn:type&gt;
      &lt;sa:primaryKey&gt;-1&lt;/sa:primaryKey&gt;
    &lt;/sa:orderKey&gt;
    &lt;sa:priority&gt;3&lt;/sa:priority&gt;
    &lt;sa:orderState smpState=&quot;open.not_running.not_started&quot; xsi:type=&quot;smp:SubOrderStateType&quot;&gt;open.not_running.not_started&lt;/sa:orderState&gt;
    &lt;smp:subKey&gt;
      &lt;cmn:type&gt;SubSpec:-&lt;/cmn:type&gt;
      &lt;smpcbe:primaryKey&gt;10000&lt;/smpcbe:primaryKey&gt;
    &lt;/smp:subKey&gt;
    &lt;smp:orderParamList&gt;
      &lt;smpcmn:param name=&quot;queue_request_flag&quot;&gt;yes&lt;/smpcmn:param&gt;
      &lt;smpcmn:param name=&quot;has_groups&quot;&gt;yes&lt;/smpcmn:param&gt;
    &lt;/smp:orderParamList&gt;
    &lt;smp:orderItemList&gt;
      &lt;smp:orderItem&gt;
        &lt;smp:action&gt;add&lt;/smp:action&gt;
        &lt;smp:itemParamList/&gt;
        &lt;smpsa:entityKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcKeyType&quot;&gt;
          &lt;cmn:type&gt;SubSvcSpec:email_server_unblock&lt;/cmn:type&gt;
          &lt;smp:externalKey&gt;email_server_unblock_1000000000000&lt;/smp:externalKey&gt;
        &lt;/smpsa:entityKey&gt;
        &lt;smpsa:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:email_server_unblock&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;email_server_unblock_1000000000000&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:parentServiceKey&gt;
            &lt;cmn:type&gt;SubSvc&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;cable_broadband_1000000000000&lt;/smp:externalKey&gt;
          &lt;/smp:parentServiceKey&gt;
          &lt;smp:paramList&gt;
            &lt;smpcbe:param name=&quot;email_server_unblock_service_id&quot;&gt;email_server_unblock_1000000000000&lt;/smpcbe:param&gt;
            &lt;smpcbe:param name=&quot;email_server_unblock_product_code&quot;&gt;abcd&lt;/smpcbe:param&gt;
          &lt;/smp:paramList&gt;
        &lt;/smpsa:entityValue&gt;
      &lt;/smp:orderItem&gt;
    &lt;/smp:orderItemList&gt;
  &lt;/smp:orderValue&gt;
&lt;/smpsa:executeOrderRequest&gt;</xmlRequest> 
  </m:executeXml>
  </SOAP-ENV:Body>
  </SOAP-ENV:Envelope>